In [1]:
import pandas as pd
import sqlalchemy as db
import getpass

In [2]:
password = getpass.getpass("Insert your mysql root password: ")
connectionData = f"mysql+pymysql://root:{password}@localhost/publications"

Insert your mysql root password: ········

In [3]:
engine = db.create_engine(connectionData)
print("Connected to server!")

Connected to server!

In [5]:
df = pd.read_sql_query("""
SELECT Store, ord_num AS OrderNumber, ord_date AS OrderDate, title AS Title, sales.qty AS Qty, price AS Price, type as Type
FROM (
	SELECT stores.stor_id AS StoreID, stores.stor_name AS Store, COUNT(DISTINCT(ord_num)) AS Orders, COUNT(title_id) AS Items, SUM(qty) AS Qty
	FROM publications.sales sales
	INNER JOIN publications.stores stores ON stores.stor_id = sales.stor_id
	GROUP BY StoreID, Store
) summary
INNER JOIN publications.sales sales ON summary.StoreID = sales.stor_id
INNER JOIN publications.titles ON sales.title_id = titles.title_id
WHERE Items / Orders > 1;
""", engine)

In [6]:
df.head()

,Store,OrderNumber,OrderDate,Title,Qty,Price,Type
0,News & Brews,D4482,1994-09-14,Is Anger the Enemy?,10,10.95,psychology
1,News & Brews,P2121,1992-06-15,"Onions, Leeks, and Garlic: Cooking Secrets of ...",40,20.95,trad_cook
2,News & Brews,P2121,1992-06-15,Fifty Years in Buckingham Palace Kitchens,20,11.95,trad_cook
3,News & Brews,P2121,1992-06-15,"Sushi, Anyone?",20,14.99,trad_cook
4,Doc-U-Mat: Quality Laundry and Books,N914008,1994-09-14,Is Anger the Enemy?,20,10.95,psychology

In [21]:
%%time
pd.read_sql_query("SELECT * FROM employee",engine)["job_id"].sum()

CPU times: user 4.8 ms, sys: 1.18 ms, total: 5.98 ms
Wall time: 6.63 ms

365

In [23]:
%%time
pd.read_sql_query("SELECT sum(job_id) as j FROM employee",engine)["j"][0]

CPU times: user 2.65 ms, sys: 1.62 ms, total: 4.27 ms
Wall time: 4.22 ms

365.0

In [24]:
pd.read_sql_query("SELECT sum(job_id) as j FROM employee",engine)

       j
0  365.0

In [27]:
def getByType(t):
    df = pd.read_sql_query("""
    SELECT Store, ord_num AS OrderNumber, ord_date AS OrderDate, title AS Title, sales.qty AS Qty, price AS Price, type as Type
    FROM (
        SELECT stores.stor_id AS StoreID, stores.stor_name AS Store, COUNT(DISTINCT(ord_num)) AS Orders, COUNT(title_id) AS Items, SUM(qty) AS Qty
        FROM publications.sales sales
        INNER JOIN publications.stores stores ON stores.stor_id = sales.stor_id
        GROUP BY StoreID, Store
    ) summary
    INNER JOIN publications.sales sales ON summary.StoreID = sales.stor_id
    INNER JOIN publications.titles ON sales.title_id = titles.title_id
    WHERE Items / Orders > 1 AND Type="{}";
    """.format(t), engine)
    return df

In [30]:
types = ["psychology","trad_cook"]
for t in types:
    display(getByType(t).head())

,Store,OrderNumber,OrderDate,Title,Qty,Price,Type
0,Doc-U-Mat: Quality Laundry and Books,P3087a,1993-05-29,Computer Phobic AND Non-Phobic Individuals: Be...,20,21.59,psychology
1,News & Brews,D4482,1994-09-14,Is Anger the Enemy?,10,10.95,psychology
2,Doc-U-Mat: Quality Laundry and Books,N914008,1994-09-14,Is Anger the Enemy?,20,10.95,psychology
3,Doc-U-Mat: Quality Laundry and Books,P3087a,1993-05-29,Life Without Fear,25,7.00,psychology
4,Doc-U-Mat: Quality Laundry and Books,P3087a,1993-05-29,Prolonged Data Deprivation: Four Case Studies,15,19.99,psychology

,Store,OrderNumber,OrderDate,Title,Qty,Price,Type
0,News & Brews,P2121,1992-06-15,"Onions, Leeks, and Garlic: Cooking Secrets of ...",40,20.95,trad_cook
1,News & Brews,P2121,1992-06-15,Fifty Years in Buckingham Palace Kitchens,20,11.95,trad_cook
2,News & Brews,P2121,1992-06-15,"Sushi, Anyone?",20,14.99,trad_cook